app/Http/Controllers/productController/ProductCoctroller.php

    public function index(){
        $Warehouses=Warehouse::all();
        $curr=Currency::all();
        $prod=Product::all();
---
SELECT * FROM `currencies`
SELECT * FROM `products`