app/Http/Controllers/DailyRestrictionController/RestrictionController.php

SELECT * FROM `main_accounts`
SELECT * FROM `currencies`
SELECT * FROM `general_journals` WHERE date(`created_at`) = '2024-10-04' LIMIT 1
---
    public function create(){
        $mainAccount=MainAccount::all();
        $curr=Currency::all();
        // الحصول على تاريخ اليوم
        $today = Carbon::now()->toDateString(); // الحصول على تاريخ اليوم بصيغة YYYY-MM-DD

        $dailyPage = GeneralJournal::whereDate('created_at', $today)->first(); // البحث عن الصفحة

SELECT * FROM `daily_entries`
SELECT * FROM `main_accounts`
SELECT * FROM `sub_accounts`
---
    public function   all_restrictions_show(){
        $eail=DailyEntrie::all()->take(10);
        $mainc=MainAccount::all();
        $suba=SubAccount::all();

SELECT * FROM `sub_accounts`
SELECT * FROM `daily_entries` WHERE `entrie_id` = '1' LIMIT 1
---
    public function show($id){

        $mainc=MainAccount::all();
        $suba=SubAccount::all();
        $dailyEntrie =DailyEntrie::where('entrie_id',$id)->first();

SELECT * FROM `sub_accounts`
SELECT * FROM `daily_entries` WHERE `entrie_id` = '1' LIMIT 1
---
    public function print($id){

        $mainc=MainAccount::all();
        $suba=SubAccount::all();
        $dailyEntrie =DailyEntrie::where('entrie_id',$id)->first();

SELECT * FROM `main_accounts`
SELECT * FROM `sub_accounts`
SELECT * FROM `daily_entries` WHERE `Daily_page_id` LIKE '%1%'
SELECT * FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    public function search(Request $request)
    {
        if ($request->ajax()) {

            $mainc=MainAccount::all();
            $suba=SubAccount::all();
            $output = '';
            $query = $request->get('search');
            if ($query != '') {
                $products = DailyEntrie::where('Daily_page_id', 'LIKE', '%'.$query.'%')->get();
                if ($products) {

                    foreach ($products as $product) {
                        $resultDebit=$mainc->where('main_account_id',$product->account_debit_id)->first();
                        $user=User::find($product->User_id)->value('name');

SELECT * FROM `daily_entries`
SELECT * FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
                }
            }else {
                // إذا كان الحقل فارغًا، أرجع جميع المنتجات
               $products= DailyEntrie::all()->take(10);
                foreach ($products as $product) {
                    $resultDebit=$mainc->where('main_account_id',$product->account_debit_id)->first();
                    $user=User::find($product->User_id)->value('name');