app/Http/Controllers/DailyRestrictionController/RestrictionController.php

SELECT * FROM `daily_entries`
---


        // // إنشاء القيد اليومي
        $dailyEntrie = DailyEntrie::updateOrCreate(
            [
                'entrie_id' => $entrie_id,
                'accounting_period_id' => $accountingPeriod->accounting_period_id,

            ],
            [
                'invoice_id' => $currentConditions,
                'daily_page_id' => $request->page_id ?? $dailyPage->page_id,
                'daily_entries_type' => $invoice_type ?? $Payment_type,
                'account_debit_id' => $validated['sub_account_debit_id'],
                'amount_credit' => $Amount_credit,
                'amount_debit' =>  $Amount_debit,
                'account_credit_id' => $validated['sub_account_debit_id'],
                'exchange_rate' => $validated['exchange_rate'] ?? $validated['exchange_rate_credit'],
                'statement' => $validated['Statement']  ?? $invoice_type,
                'invoice_type' =>  null,
                'currency_name' => $validated['Currency_name'] ?? $validated['Currency_name_credit'],
                'user_id' => $validated['User_id'],
                'status_debit' => 'غير مرحل',
                'status' => 'غير مرحل',