app/Http/Controllers/accounts/main_accounts/MainAccountController.php

SELECT * FROM `main_accounts`
SELECT * FROM `sub_accounts`
---
    public function create(){
        $mainAccount=MainAccount::all();//
        $subAccount = SubAccount::all();

SELECT * FROM `sub_accounts` WHERE `Main_id` = '1'
---
public function getSubAccounts(Request $request , $id)

{
    $subAccounts = SubAccount::where('Main_id', $id)->get();