
<div class="max-w-72">
<div class="max-sm:w-15">
    <div class="w-2/2 min-h-screen text-white sticky top-0 p-4 bg-amber-400 border-b border-gray-100">
        <ul class="list-none ">
            <li class="mb-2">
                <a class="NavTagA" href="{{route('home.indxe')}}">
                    <svg class="w-6 h-6 stroke-current " xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24"
                    stroke="currentColor">
                    <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2"
                    d="M3 12l2-2m0 0l7-7 7 7M5 10v10a1 1 0 001 1h3m10-11l2 2m-2-2v10a1 1 0 01-1 1h-3m-6 0a1 1 0 001-1v-4a1 1 0 011-1h2a1 1 0 011 1v4a1 1 0 001 1m-6 0h6" />
                </svg>
                <span class="textNav"> الرئسية</span>
                    </a>
                </li>
                    <li class="mb-2">
                    <a class=" NavTagA" onclick="disSection()" href="{{route('accounts.index')}}">
                    <svg class="w-6 h-6 stroke-current " xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24"stroke="currentColor">
                        <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2"d="M3 12l2-2m0 0l7-7 7 7M5 10v10a1 1 0 001 1h3m10-11l2 2m-2-2v10a1 1 0 01-1 1h-3m-6 0a1 1 0 001-1v-4a1 1 0 011-1h2a1 1 0 011 1v4a1 1 0 001 1m-6 0h6" />
                    </svg>
                    <span class="textNav"> الحسابات</span>
                    </a>
                </li>
            <li class="mb-2">
                <a class="NavTagA" href="{{route('sales.index')}}">
                <svg class="w-6 h-6  text-white dark:text-white" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none" viewBox="0 0 24 24">
                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M8 17.345a4.76 4.76 0 0 0 2.558 1.618c2.274.589 4.512-.446 4.999-2.31.487-1.866-1.273-3.9-3.546-4.49-2.273-.59-4.034-2.623-3.547-4.488.486-1.865 2.724-2.899 4.998-2.31.982.236 1.87.793 2.538 1.592m-3.879 12.171V21m0-18v2.2"/>
                </svg>
                <span class="textNav">المبيعات</span>
                </a></li>
                <li class="mb-2"><a class="NavTagA" href="{{route('Purchases.index')}}">
                    <svg class="w-6 h-6  text-white dark:text-white" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none" viewBox="0 0 24 24">
                        <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M5 4h1.5L9 16m0 0h8m-8 0a2 2 0 1 0 0 4 2 2 0 0 0 0-4Zm8 0a2 2 0 1 0 0 4 2 2 0 0 0 0-4Zm-8.5-3h9.25L19 7h-1M8 7h-.688M13 5v4m-2-2h4"/>
                        </svg>
                    <span class="textNav">المشتريات</span>
                    </a></li>
                <li class="mb-2"><a class="NavTagA" href="{{route('products.index')}}">
                    <svg class="w-6 h-6 stroke-current" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24"
                        stroke="currentColor">
                        <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2"
                        d="M3 3h2l.4 2M7 13h10l4-8H5.4M7 13L5.4 5M7 13l-2.293 2.293c-.63.63-.184 1.707.707 1.707H17m0 0a2 2 0 100 4 2 2 0 000-4zm-8 2a2 2 0 11-4 0 2 2 0 014 0z" />
                    </svg>
                    <span class="textNav">المنتجات</span>
                    </a></li>
                    <li class="mb-2">
                    <a class="NavTagA" href="{{route('payments.index')}}">
                    <svg class="w-6 h-6 stroke-current"  fill="none" viewBox="0 0 168 153" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#a)" fill="#ffffff" class="fill-000000" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"><path d="M38.607 139.004c-.984 3.55-1.534 4.553-2.524 7.839a5.685 5.685 0 0 1-4.764 4.257c-6.433.946-12.872 2.069-19.414 1.142-6.001-.853-9.834-4.618-10.134-10.674-.51-10.313-.69-20.642-.957-30.966-.078-3.028-.118-6.069.072-9.089.386-6.133 3.262-9.4 9.386-9.817 6.71-.46 13.463-.347 20.197-.356 2.645-.003 4.281 1.763 5.448 3.941.575 1.076.984 2.238 1.44 3.282 4.19-.59 8.245-1.336 12.332-1.701 7.478-.667 14.842.131 21.806 3.03 8.107 3.377 16.47 4.097 25.102 3.272a26.145 26.145 0 0 1 6.367.206c6.908 1.05 10.229 6.179 8.503 12.903-.138.536-.344 1.05-.718 2.182 2.425-.176 4.571-.258 6.699-.498 9.12-1.032 17.625-4.282 26.188-7.324 3.803-1.351 7.568-2.852 11.451-3.915a21.715 21.715 0 0 1 6.981-.615c4.154.263 6.09 3.282 5.027 7.275-.872 3.282-2.877 5.786-5.331 8.007-7.114 6.433-15.446 10.727-24.429 13.864-12.646 4.415-25.563 7.724-38.889 9.268-17.672 2.153-35.849 2.174-52.687-3.606-2.403-.832-4.905-1.173-7.152-1.907Zm.124-6.365c4.07 1.073 7.84 2.085 11.617 3.059 11.81 3.04 23.816 4.768 35.999 3.947 18.18-1.224 35.601-5.915 52.494-12.612a59.559 59.559 0 0 0 17.758-10.787 40.599 40.599 0 0 0 3.213-3.586l-.561-.844c-2.418.717-4.865 1.35-7.249 2.166-8.274 2.832-16.466 5.918-24.804 8.54-6.583 2.069-13.371 2.918-20.281 1.421a4.684 4.684 0 0 0-2.872.448c-8.778 4.457-18.257 5.26-27.846 5.312a24.848 24.848 0 0 1-6.573-1.208 2.51 2.51 0 0 1-1.63-1.159 2.518 2.518 0 0 1-.274-1.981 4.951 4.951 0 0 1 2.05-2.746 9.568 9.568 0 0 1 3.897-.899c3.694-.293 7.397-.459 11.097-.664 5.185-.291 10.32-.967 15.065-3.157a15.16 15.16 0 0 0 5.049-3.727c1.72-2.003.804-3.972-1.838-4.24a39.005 39.005 0 0 0-6.385.072c-8.73.561-17.275-.04-25.418-3.613a43.333 43.333 0 0 0-4.74-1.73 44.317 44.317 0 0 0-24.91-.447c-3.18.853-3.15.991-2.982 4.181.268 5.156.622 10.311.716 15.472.052 2.783-.36 5.574-.594 8.783l.002-.001Zm-9.353-34.964c-5.382 0-10.522-.05-15.663.015-4.604.058-5.752 1.23-5.852 5.827-.257 11.776-.641 23.552-.656 35.328-.006 4.988 2.47 6.614 6.01 6.349 4.695-.351 9.387-.776 14.061-1.338 2.466-.296 2.9-1.061 2.857-3.65a49.036 49.036 0 0 1-.018-6.387c1.247-10.884.366-21.746-.175-32.613a34.375 34.375 0 0 0-.566-3.53h.002ZM95.608 40.885c7.178 4.91 9.836 12.166 10.637 20.436 1.402 14.49-7.196 23.516-17.279 27.37-8.307 3.178-16.828 4.791-25.668 2.196-10.251-3.01-16.297-11.232-16.675-21.889-.472-13.315 7.51-25.448 20.598-30.796 7.968-3.252 23.446-.697 28.387 2.683ZM71.243 84.797c4.34.518 12.237-1.346 16.146-3.065 7.211-3.172 12.493-9.01 11.266-19.67-1.024-8.89-5.537-15.663-14.145-17.445-4.492-.93-13.268-1.348-17.732.547-9.748 4.134-13.533 13.914-13.025 24.601.498 10.45 11.027 14.263 17.49 15.034v-.002Z"></path><path d="M18.485 112.204c-2.921.035-4.973-1.842-5.078-4.644-.118-3.213 2.414-6.028 5.439-6.047 3.511-.02 6.224 2.035 6.247 4.726.025 2.905-3.324 5.924-6.608 5.965ZM77.957 54.756v7.972c1.163.438 2.25.8 3.298 1.251 4.123 1.773 5.137 5.648 2.434 9.211-1.116 1.468-1.993 2.062-5.276 3.57-.31 1.575-.622 3.126-.92 4.68-.164.867-.577 1.538-1.523 1.56-.998.023-1.348-.788-1.526-1.573-.334-1.47-.561-2.965-.864-4.62-1.207-.323-2.522-.664-3.83-1.028a11.868 11.868 0 0 1-1.854-.6 2.239 2.239 0 0 1-1.448-2.617c.212-1.043 1.108-1.703 2.489-1.613 1.503.099 2.997.354 4.457.536.61-1.681.68-2.682.414-5.545-1.017-.381-2.118-.718-3.15-1.196-4.19-1.932-5.114-6.117-2.145-9.657a11.057 11.057 0 0 1 4.677-3.435 2.18 2.18 0 0 0 1.61-2.25c.01-.795.183-1.578.508-2.303a1.693 1.693 0 0 1 1.331-.818 1.714 1.714 0 0 1 1.148 1.07c.182.928.28 1.869.296 2.813.998.227 1.984.506 2.953.834 1.548.61 2.28 1.81 2.092 3.178-.167 1.21-.826 1.62-1.955 1.123-.988-.433-1.909-1.078-3.216-.543Zm-3.82 1.58c-2.12 1.259-3.205 2.597-2.813 3.594.468 1.191 1.554 1.491 2.813 1.655v-5.248ZM78.1 71.279c1.41-.52 2.701-1.143 2.659-2.57-.037-1.198-1.356-1.444-2.429-1.606-.062-.009-.131.046-.404.148 0 .834-.015 1.746.008 2.657.01.4.094.797.166 1.37ZM131.63 18.427v7.974c1.162.437 2.248.799 3.296 1.247 4.124 1.772 5.138 5.648 2.435 9.211-1.116 1.467-1.993 2.061-5.276 3.57-.31 1.575-.622 2.47-.919 4.023-.165.867-.579 1.538-1.524 1.56-.998.023-1.349-.788-1.526-1.572-.334-1.47-.561-2.309-.864-3.965-1.207-.323-2.521-.664-3.83-1.027a11.96 11.96 0 0 1-1.854-.601 2.24 2.24 0 0 1-1.448-2.617c.212-1.042 1.109-1.702 2.488-1.612 1.505.098 2.998.353 4.459.536.609-1.682.679-2.683.413-5.545-1.017-.382-2.118-.718-3.153-1.196-4.191-1.933-5.113-6.118-2.145-9.657a11.064 11.064 0 0 1 4.678-3.435 2.18 2.18 0 0 0 1.61-2.25 5.786 5.786 0 0 1 .507-2.303 1.694 1.694 0 0 1 1.332-.82 1.717 1.717 0 0 1 1.147 1.073c.181.926.281 1.868.296 2.812a29.61 29.61 0 0 1 2.954.834c1.547.609 2.28 1.81 2.091 3.177-.167 1.211-.826 1.62-1.955 1.123-.985-.43-1.906-1.075-3.212-.54Zm-3.82 1.58c-2.122 1.26-3.206 2.598-2.815 3.595.468 1.19 1.555 1.491 2.815 1.655v-5.25Zm3.962 14.943c1.409-.52 2.701-1.143 2.658-2.57-.035-1.198-1.355-1.445-2.428-1.606-.062-.009-.132.046-.404.148 0 .834-.015 1.746.007 2.657.01.4.095.797.167 1.371Z"></path><path d="M148.574 4.655c7.178 4.91 9.836 12.167 10.637 20.436 1.402 14.49-7.196 23.516-17.279 27.37-8.307 3.177-16.827 4.791-25.667 2.196-10.252-3.01-16.297-11.233-16.675-21.89-.473-13.315 7.51-25.447 20.597-30.795 7.968-3.25 23.446-.695 28.387 2.683ZM124.21 48.567c4.34.518 12.236-1.346 16.146-3.065 7.211-3.171 12.492-9.01 11.265-19.669-1.024-8.89-5.536-15.663-14.144-17.445-4.493-.93-13.267-1.348-17.732.546-9.748 4.135-13.533 13.915-13.025 24.601.496 10.452 11.027 14.264 17.49 15.035v-.003Z"></path></g><defs><clipPath id="a"><path fill="#ffffff" transform="translate(.144 .455)" d="M0 0h167.366v152.27H0z" class="fill-ffffff"></path></clipPath></defs></svg>
                    <span class="textNav mr-1"> المدفوعات</span>
                    </a></li>
                    <li class="mb-2">
                    <a class="NavTagA" href="{{route('refunds.index')}}">
                        <svg class="w-6 h-6" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M0 0h24v24H0z" fill="none"></path><path d="M5.671 4.257c3.928-3.219 9.733-2.995 13.4.672 3.905 3.905 3.905 10.237 0 14.142-3.905 3.905-10.237 3.905-14.142 0A9.993 9.993 0 0 1 2.25 9.767l.077-.313 1.934.51a8 8 0 1 0 3.053-4.45l-.221.166L8.11 6.697l-4.596 1.06 1.06-4.596L5.67 4.257zM13 6v2h2.5v2H10a.5.5 0 0 0-.09.992L10 11h4a2.5 2.5 0 1 1 0 5h-1v2h-2v-2H8.5v-2H14a.5.5 0 0 0 .09-.992L14 13h-4a2.5 2.5 0 1 1 0-5h1V6h2z" fill="#ffffff" class="fill-000000"></path></svg>
                            <span class="textNav"> المردودات</span>
                    </a></li>
                    <li class="mb-2">
                    <a class="NavTagA" href="{{route('fixed.index')}}">
                        <svg class="w-6 h-6" viewBox="0 0 48 48" xml:space="preserve" xmlns="http://www.w3.org/2000/svg"><path clip-rule="evenodd" d="M46 44.438H2a1 1 0 1 1 0-2h44a1 1 0 1 1 0 2zm-30-10a1 1 0 1 1 0 2H8a1 1 0 1 1 0-2h1v-13H8a1 1 0 1 1 0-2h8a1 1 0 1 1 0 2h-1v13h1zm-3-13h-2v13h2v-13zm15 13a1 1 0 1 1 0 2h-8a1 1 0 1 1 0-2h1v-13h-1a1 1 0 1 1 0-2h8a1 1 0 1 1 0 2h-1v13h1zm-3-13h-2v13h2v-13zm19 18a1 1 0 0 1-1 1H5a1 1 0 1 1 0-2h38a1 1 0 0 1 1 1zm-4-5a1 1 0 1 1 0 2h-8a1 1 0 1 1 0-2h1v-13h-1a1 1 0 1 1 0-2h8a1 1 0 1 1 0 2h-1v13h1zm-3-13h-2v13h2v-13zm-34-6L24 4l21 11.438v2H3v-2zm37.541 0L24 6.886 7.396 15.438h33.145z" fill-rule="evenodd" fill="#ffffff" class="fill-000000"></path></svg>
                            <span class="textNav"> الأصول الثابتة</span>
                    </a></li>
                <li class="mb-2">
                    <a class="NavTagA " href="#">
                        <svg class="w-6 h-6" viewBox="0 0 32 32" xmlns="http://www.w3.org/2000/svg"><path d="M28 25V10a1 1 0 0 0-1-1h-4a1 1 0 0 0-1 1v15h-2V6a1 1 0 0 0-1-1h-4a1 1 0 0 0-1 1v19h-2V15a1 1 0 0 0-1-1H7a1 1 0 0 0-1 1v10H4V5H2v21a1 1 0 0 0 1 1h27v-2Zm-4-14h2v14h-2Zm-8-4h2v18h-2Zm-8 9h2v9H8Z" data-name="2" fill="#ffffff" class="fill-000000"></path></svg>
                        <span class="textNav mr-1">تحليل البيانات</span>
                    </a></li>
                <li class="mb-2">
                    <a class="NavTagA" href="{{route('inventory.index')}}">
                    <svg class="w-6 h-6 stroke-current" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24"
                        stroke="currentColor">
                        <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2"
                        d="M8 7v8a2 2 0 002 2h6M8 7V5a2 2 0 012-2h4.586a1 1 0 01.707.293l4.414 4.414a1 1 0 01.293.707V15a2 2 0 01-2 2h-2M8 7H6a2 2 0 00-2 2v10a2 2 0 002 2h8a2 2 0 002-2v-2" />
                    </svg>
                    <span class="textNav">قائمة الجرد</span>
                    </a>
                </li>
                <li class="mb-2">
                    <a class="NavTagA" href="">
                    <svg class="w-6 h-6 stroke-current" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24"
                        stroke="currentColor">
                        <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2"
                        d="M7 8h10M7 12h4m1 8l-4-4H5a2 2 0 01-2-2V6a2 2 0 012-2h14a2 2 0 012 2v8a2 2 0 01-2 2h-3l-4 4z" />
                    </svg>
                    <span class="textNav">الرسائل</span>
                    <span class="absolute top-0 left-0 w-2 h-2 mt-2 ml-2 bg-indigo-500 rounded-full"></span>
                    </a>
                </li>
                <li class="mb-2">
                    <a class="NavTagA" href="{{route('customers.index')}}">
                    <svg class="w-6 h-6  text-white dark:text-white" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none" viewBox="0 0 24 24">
                        <path stroke="currentColor" stroke-linecap="round" stroke-width="2" d="M4.5 17H4a1 1 0 0 1-1-1 3 3 0 0 1 3-3h1m0-3.05A2.5 2.5 0 1 1 9 5.5M19.5 17h.5a1 1 0 0 0 1-1 3 3 0 0 0-3-3h-1m0-3.05a2.5 2.5 0 1 0-2-4.45m.5 13.5h-7a1 1 0 0 1-1-1 3 3 0 0 1 3-3h3a3 3 0 0 1 3 3 1 1 0 0 1-1 1Zm-1-9.5a2.5 2.5 0 1 1-5 0 2.5 2.5 0 0 1 5 0Z"/>
                    </svg>
                    <span class="textNav">العملاء</span>
                    </a>
                </li>
                <li class="mb-2">
                    <a class="NavTagA" href="{{route('suppliers.index')}}">
                        <svg class="w-6 h-6  text-white dark:text-white" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none" viewBox="0 0 24 24">
                    <path stroke="currentColor" stroke-linecap="round" stroke-width="2" d="M4.5 17H4a1 1 0 0 1-1-1 3 3 0 0 1 3-3h1m0-3.05A2.5 2.5 0 1 1 9 5.5M19.5 17h.5a1 1 0 0 0 1-1 3 3 0 0 0-3-3h-1m0-3.05a2.5 2.5 0 1 0-2-4.45m.5 13.5h-7a1 1 0 0 1-1-1 3 3 0 0 1 3-3h3a3 3 0 0 1 3 3 1 1 0 0 1-1 1Zm-1-9.5a2.5 2.5 0 1 1-5 0 2.5 2.5 0 0 1 5 0Z"/>
                </svg>
                <span class="textNav">الموردين</span>
                        </a></li>
                <li class="mb-2">
                    <a class="NavTagA" href="#">
                    <svg class="w-6 h-6  text-white stroke-current" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24"stroke="currentColor">
                        <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2"d="M12 6V4m0 2a2 2 0 100 4m0-4a2 2 0 110 4m-6 8a2 2 0 100-4m0 4a2 2 0 110-4m0 4v2m0-6V4m6 6v10m6-2a2 2 0 100-4m0 4a2 2 0 110-4m0 4v2m0-6V4" />
                    </svg>
                    <span class="textNav">الإعدادات</span>
                    </a></li>
        </ul>
    </div>
</div>
</div>

